contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Flash Compaction, Execute, Program and Read
#define FCFG1_O_FLASH_C_E_P_R                                       0x00000174

// Flash Program, Read, and Program Verify
#define FCFG1_O_FLASH_P_R_PV                                        0x00000178

// Flash Erase Hold and Sequence
#define FCFG1_O_FLASH_EH_SEQ                                        0x0000017C

// Flash VHV Erase
#define FCFG1_O_FLASH_VHV_E                                         0x00000180

// Flash Program Pulse
#define FCFG1_O_FLASH_PP                                            0x00000184

// Flash Program and Erase Pulse
#define FCFG1_O_FLASH_PROG_EP                                       0x00000188

// Flash Erase Pulse Width
#define FCFG1_O_FLASH_ERA_PW                                        0x0000018C

// Flash VHV
#define FCFG1_O_FLASH_VHV                                           0x00000190

// Flash VHV Program Verify
#define FCFG1_O_FLASH_VHV_PV                                        0x00000194

// Flash Voltages
#define FCFG1_O_FLASH_V                                             0x00000198

// User Identification
#define FCFG1_O_USER_ID                                             0x00000294

// Flash OTP Data 1
#define FCFG1_O_FLASH_OTP_DATA1                                     0x000002A8

// Flash OTP Data 2
#define FCFG1_O_FLASH_OTP_DATA2                                     0x000002AC

// Flash OTP Data 3
#define FCFG1_O_FLASH_OTP_DATA3                                     0x000002B0

// MAC BLE Address 0
#define FCFG1_O_MAC_BLE_0                                           0x000002E8

// MAC BLE Address 1
#define FCFG1_O_MAC_BLE_1                                           0x000002EC

// MAC IEEE 802.15.4 Address 0
#define FCFG1_O_MAC_15_4_0                                          0x000002F0

// MAC IEEE 802.15.4 Address 1
#define FCFG1_O_MAC_15_4_1                                          0x000002F4

// Flash OTP Data 4
#define FCFG1_O_FLASH_OTP_DATA4                                     0x00000308

//
#define FCFG1_O_MISC_TRIM                                           0x0000030C

// RCOSC HF Temperature Compensation
#define FCFG1_O_RCOSC_HF_TEMPCOMP                                   0x00000310

// Production Test Trim and Calibration Revision
#define FCFG1_O_TRIM_CAL_REVISION                                   0x00000314

// IcePick Device Identification
#define FCFG1_O_ICEPICK_DEVICE_ID                                   0x00000318

// Factory Configuration (FCFG1) Revision
#define FCFG1_O_FCFG1_REVISION                                      0x0000031C

// Misc OTP Data
#define FCFG1_O_MISC_OTP_DATA                                       0x00000320

// IO Configuration
#define FCFG1_O_IOCONF                                              0x00000344

// Configuration of IF_ADC
#define FCFG1_O_CONFIG_IF_ADC                                       0x0000034C

// Configuration of OSC
#define FCFG1_O_CONFIG_OSC_TOP                                      0x00000350

// Configuration of RF Frontend in Divide-by-2 Mode
#define FCFG1_O_CONFIG_RF_FRONTEND                                  0x00000354

// Configuration of Synthesizer in Divide-by-2 Mode
#define FCFG1_O_CONFIG_SYNTH                                        0x00000358

// AUX_ADC Gain in Absolute Reference Mode
#define FCFG1_O_SOC_ADC_ABS_GAIN                                    0x0000035C

// AUX_ADC Gain in Relative Reference Mode
#define FCFG1_O_SOC_ADC_REL_GAIN                                    0x00000360

// AUX_ADC Gain in External Reference Mode
#define FCFG1_O_SOC_ADC_EXT_GAIN                                    0x00000364

// AUX_ADC Temperature Offsets in Absolute Reference Mode
#define FCFG1_O_SOC_ADC_OFFSET_INT                                  0x00000368

// AUX_ADC Reference Trim and Offset for External Reference Mode
#define FCFG1_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT                     0x0000036C

// Ampltude Compensation Threashold 1
#define FCFG1_O_AMPCOMP_TH1                                         0x00000370

// Ampltude Compensation Threashold 2
#define FCFG1_O_AMPCOMP_TH2                                         0x00000374

// Amplitude Compensation Control
#define FCFG1_O_AMPCOMP_CTRL1                                       0x00000378

// Analog Bypass Value for OSC
#define FCFG1_O_ANABYPASS_VALUE2                                    0x0000037C

// Configuration of IFADC in Divide-by-2 Mode
#define FCFG1_O_CONFIG_MISC_ADC                                     0x00000380

// Test Temperatures
#define FCFG1_O_TEST_TEMPS                                          0x00000384

// Voltage Trim
#define FCFG1_O_VOLT_TRIM                                           0x00000388

// OSC Configuration
#define FCFG1_O_OSC_CONF                                            0x0000038C

// Frequency Offset
#define FCFG1_O_FREQ_OFFSET                                         0x00000390

// Capasitor Trim
#define FCFG1_O_CAP_TRIM                                            0x00000394

// Misc OSC Control
#define FCFG1_O_MISC_OTP_DATA_1                                     0x00000398

// Power Down Current Control 20C
#define FCFG1_O_PWD_CURR_20C                                        0x0000039C

// Power Down Current Control 35C
#define FCFG1_O_PWD_CURR_35C                                        0x000003A0

// Power Down Current Control 50C
#define FCFG1_O_PWD_CURR_50C                                        0x000003A4

// Power Down Current Control 65C
#define FCFG1_O_PWD_CURR_65C                                        0x000003A8

// Power Down Current Control 80C
#define FCFG1_O_PWD_CURR_80C                                        0x000003AC

// Power Down Current Control 95C
#define FCFG1_O_PWD_CURR_95C                                        0x000003B0

// Power Down Current Control 110C
#define FCFG1_O_PWD_CURR_110C                                       0x000003B4

// Power Down Current Control 125C
#define FCFG1_O_PWD_CURR_125C                                       0x000003B8

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV5
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IB_M                    0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_IB_S                    28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_LNA_IB_M                      0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_LNA_IB_S                      24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_TRIM_M                  0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_IFAMP_TRIM_S                  19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_CTL_PA0_TRIM_M                0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_CTL_PA0_TRIM_S                14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_M           0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV5_RFLDO_TRIM_OUTPUT_S           0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV6
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_M                    0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_IB_S                    28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_M                      0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_LNA_IB_S                      24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_M                  0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_IFAMP_TRIM_S                  19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_M                0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_CTL_PA0_TRIM_S                14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_M           0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV6_RFLDO_TRIM_OUTPUT_S           0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV10
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_M                   0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_IB_S                   28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_M                     0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_LNA_IB_S                     24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_M                 0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_IFAMP_TRIM_S                 19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_M               0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_CTL_PA0_TRIM_S               14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_M          0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV10_RFLDO_TRIM_OUTPUT_S          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV12
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB_M                   0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_IB_S                   28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_M                     0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_LNA_IB_S                     24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_M                 0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_IFAMP_TRIM_S                 19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_M               0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_CTL_PA0_TRIM_S               14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_M          0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV12_RFLDO_TRIM_OUTPUT_S          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV15
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB_M                   0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_IB_S                   28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_M                     0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_LNA_IB_S                     24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_M                 0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_IFAMP_TRIM_S                 19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_M               0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_CTL_PA0_TRIM_S               14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_M          0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV15_RFLDO_TRIM_OUTPUT_S          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND_DIV30
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value used for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB_M                   0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_IB_S                   28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_M                     0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_LNA_IB_S                     24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_M                 0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_IFAMP_TRIM_S                 19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_M               0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_CTL_PA0_TRIM_S               14

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_M          0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_DIV30_RFLDO_TRIM_OUTPUT_S          0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH_DIV5
//
//*****************************************************************************
// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Trim value for RFC_MDM:DEMIQMC0.GAINFACTOR and RFC_MDM:DEMIQMC0.PHASEFACTOR
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_M                  0x0FFFF000
#define FCFG1_CONFIG_SYNTH_DIV5_RFC_MDM_DEMIQMC0_S                  12

// Field: [11:6] LDOVCO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_1_SYNTH:VCOLDOCTL1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_M                0x00000FC0
#define FCFG1_CONFIG_SYNTH_DIV5_LDOVCO_TRIM_OUTPUT_S                6

