contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV5_QUANTCTLTHRES_S                  6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV5_DACTRIM_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV6
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_M                    0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV6_RSSI_OFFSET_S                    9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_M                  0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV6_QUANTCTLTHRES_S                  6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_M                        0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV6_DACTRIM_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV10
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV10_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV10_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV10_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV12
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV12_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV12_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV12_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV15
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV15_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV15_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV15_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_MISC_ADC_DIV30
//
//*****************************************************************************
// Field: [16:9] RSSI_OFFSET
//
// Value for RSSI measured in production test.
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_M                   0x0001FE00
#define FCFG1_CONFIG_MISC_ADC_DIV30_RSSI_OFFSET_S                   9

// Field: [8:6] QUANTCTLTHRES
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCQUANT0.TH].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_M                 0x000001C0
#define FCFG1_CONFIG_MISC_ADC_DIV30_QUANTCTLTHRES_S                 6

// Field: [5:0] DACTRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCDAC.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
//
#define FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_M                       0x0000003F
#define FCFG1_CONFIG_MISC_ADC_DIV30_DACTRIM_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_EFUSE_CONTROL
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FCFG1_O_SHDW_REDUNDANT0
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FCFG1_O_SHDW_REDUNDANT1
//
//*****************************************************************************
//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_0
//
//*****************************************************************************
// Field: [31:0] ID_31_0
//
// Shadow of [JTAG_TAP::EFUSE:DIE_ID_0.*], ie efuse row number 3
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_M                               0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_0_ID_31_0_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_1
//
//*****************************************************************************
// Field: [31:0] ID_63_32
//
// Shadow of [JTAG_TAP::EFUSE:DIE_ID_1.*], ie efuse row number 4
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_1_ID_63_32_S                              0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_2
//
//*****************************************************************************
// Field: [31:0] ID_95_64
//
// Shadow of [JTAG_TAP::EFUSE:DIE_ID_2.*], ie efuse row number 5
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_M                              0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_2_ID_95_64_S                              0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_DIE_ID_3
//
//*****************************************************************************
// Field: [31:0] ID_127_96
//
// Shadow of [JTAG_TAP::EFUSE:DIE_ID_3.*], ie efuse row number 6
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_M                             0xFFFFFFFF
#define FCFG1_SHDW_DIE_ID_3_ID_127_96_S                             0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_SCAN_DATA0
//
//*****************************************************************************
// Field: [31:29] ULL_MCU_RAM1_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA0.ULL_MCU_RAM1_REP], ie in efuse row number
// 7
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM1_REP_M                    0xE0000000
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM1_REP_S                    29

// Field: [28:19] ULL_MCU_RAM2_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA0.ULL_MCU_RAM2_REP], ie in efuse row number
// 7
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM2_REP_M                    0x1FF80000
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM2_REP_S                    19

// Field: [18:9] ULL_MCU_RAM3_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA0.ULL_MCU_RAM3_REP], ie in efuse row number
// 7
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM3_REP_M                    0x0007FE00
#define FCFG1_SHDW_SCAN_DATA0_ULL_MCU_RAM3_REP_S                    9

// Field: [8:1] ULL_AUX_RAM_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA0.ULL_AUX_RAM_REP], ie in efuse row number 7
#define FCFG1_SHDW_SCAN_DATA0_ULL_AUX_RAM_REP_M                     0x000001FE
#define FCFG1_SHDW_SCAN_DATA0_ULL_AUX_RAM_REP_S                     1

// Field: [0]    TAP_DAP_LOCK
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA0.TAP_DAP_LOCK], ie in efuse row number 7
#define FCFG1_SHDW_SCAN_DATA0_TAP_DAP_LOCK                          0x00000001
#define FCFG1_SHDW_SCAN_DATA0_TAP_DAP_LOCK_BITN                     0
#define FCFG1_SHDW_SCAN_DATA0_TAP_DAP_LOCK_M                        0x00000001
#define FCFG1_SHDW_SCAN_DATA0_TAP_DAP_LOCK_S                        0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_SCAN_DATA1
//
//*****************************************************************************
// Field: [16:7] ULL_MCU_RAM0_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA1.ULL_MCU_RAM0_REP], ie in efuse row number
// 8
#define FCFG1_SHDW_SCAN_DATA1_ULL_MCU_RAM0_REP_M                    0x0001FF80
#define FCFG1_SHDW_SCAN_DATA1_ULL_MCU_RAM0_REP_S                    7

// Field: [6:0] ULL_MCU_RAM1_REP
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA1.ULL_MCU_RAM1_REP], ie in efuse row number
// 8
#define FCFG1_SHDW_SCAN_DATA1_ULL_MCU_RAM1_REP_M                    0x0000007F
#define FCFG1_SHDW_SCAN_DATA1_ULL_MCU_RAM1_REP_S                    0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_SCAN_DATA2_BOOT
//
//*****************************************************************************
// Field: [31]    FLASH_RDY
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.FLASH_RDY], ie in efuse row number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_FLASH_RDY                        0x80000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_FLASH_RDY_BITN                   31
#define FCFG1_SHDW_SCAN_DATA2_BOOT_FLASH_RDY_M                      0x80000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_FLASH_RDY_S                      31

// Field: [30]    STANDBY_MODE_SEL_INT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.STANDBY_MODE_SEL_INT], ie in efuse
// row number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_INT             0x40000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_INT_BITN        30
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_INT_M           0x40000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_INT_S           30

// Field: [29:28] STANDBY_PW_SEL_INT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.STANDBY_PW_SEL_INT], ie in efuse row
// number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_PW_SEL_INT_M             0x30000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_PW_SEL_INT_S             28

// Field: [27]    DIS_STANDBY_INT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.DIS_STANDBY_INT], ie in efuse row
// number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_INT                  0x08000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_INT_BITN             27
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_INT_M                0x08000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_INT_S                27

// Field: [26:24] VIN_AT_X_INT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.VIN_AT_X_INT], ie in efuse row number
// 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_VIN_AT_X_INT_M                   0x07000000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_VIN_AT_X_INT_S                   24

// Field: [23]    STANDBY_MODE_SEL_EXT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.STANDBY_MODE_SEL_EXT], ie in efuse
// row number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_EXT             0x00800000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_EXT_BITN        23
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_EXT_M           0x00800000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_MODE_SEL_EXT_S           23

// Field: [22:21] STANDBY_PW_SEL_EXT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.STANDBY_PW_SEL_EXT], ie in efuse row
// number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_PW_SEL_EXT_M             0x00600000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_STANDBY_PW_SEL_EXT_S             21

// Field: [20]    DIS_STANDBY_EXT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.DIS_STANDBY_EXT], ie in efuse row
// number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_EXT                  0x00100000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_EXT_BITN             20
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_EXT_M                0x00100000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_DIS_STANDBY_EXT_S                20

// Field: [19:17] VIN_AT_X_EXT
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.VIN_AT_X_EXT], ie in efuse row number
// 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_VIN_AT_X_EXT_M                   0x000E0000
#define FCFG1_SHDW_SCAN_DATA2_BOOT_VIN_AT_X_EXT_S                   17

// Field: [8:1] CRC
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.CRC], ie in efuse row number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_CRC_M                            0x000001FE
#define FCFG1_SHDW_SCAN_DATA2_BOOT_CRC_S                            1

// Field: [0]    TAP_DAP_LOCK_N
//
// Shadow of [JTAG_TAP::EFUSE:SCAN_DATA2_BOOT.TAP_DAP_LOCK_N], ie in efuse row
// number 9
#define FCFG1_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N                   0x00000001
#define FCFG1_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N_BITN              0
#define FCFG1_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N_M                 0x00000001
#define FCFG1_SHDW_SCAN_DATA2_BOOT_TAP_DAP_LOCK_N_S                 0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_BANK_TRIM_BOOT
//
//*****************************************************************************
// Field: [29]    ROM_BOOT
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.ROM_BOOT], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_ROM_BOOT                          0x20000000
#define FCFG1_SHDW_BANK_TRIM_BOOT_ROM_BOOT_BITN                     29
#define FCFG1_SHDW_BANK_TRIM_BOOT_ROM_BOOT_M                        0x20000000
#define FCFG1_SHDW_BANK_TRIM_BOOT_ROM_BOOT_S                        29

// Field: [28:25] TRIM3P4
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.TRIM3P4], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM3P4_M                         0x1E000000
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM3P4_S                         25

// Field: [24:21] VCG2P5CT
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.VCG2P5CT], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_VCG2P5CT_M                        0x01E00000
#define FCFG1_SHDW_BANK_TRIM_BOOT_VCG2P5CT_S                        21

// Field: [20:17] VREADCT
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.VREADCT], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_VREADCT_M                         0x001E0000
#define FCFG1_SHDW_BANK_TRIM_BOOT_VREADCT_S                         17

// Field: [16:13] TRIM_0P8
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.TRIM_0P8], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM_0P8_M                        0x0001E000
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM_0P8_S                        13

// Field: [12:0] TRIM
//
// Shadow of [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.TRIM_SADLY],
// [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.TRIM_NMOS], and
// [JTAG_TAP::EFUSE:BANK_TRIM_BOOT.TRIM_PMOS], ie in efuse row number 10
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM_M                            0x00001FFF
#define FCFG1_SHDW_BANK_TRIM_BOOT_TRIM_S                            0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_OSC_BIAS_LDO_TRIM
//
//*****************************************************************************
// Field: [28:27] SET_RCOSC_HF_COARSE_RESISTOR
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.SET_RCOSC_HF_COARSE_RESISTOR], ie
// in efuse row number 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_M  \
                                 0x18000000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_SET_RCOSC_HF_COARSE_RESISTOR_S 27

// Field: [26:23] TRIMMAG
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.TRIMMAG], ie in efuse row number 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_M                      0x07800000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMMAG_S                      23

// Field: [22:18] TRIMIREF
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.TRIMIREF], ie in efuse row number
// 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_M                     0x007C0000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_TRIMIREF_S                     18

// Field: [17:16] ITRIM_DIG_LDO
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.ITRIM_DIG_LDO], ie in efuse row
// number 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_M                0x00030000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_ITRIM_DIG_LDO_S                16

