contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [15:12] VTRIM_DIG
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.VTRIM_DIG], ie in efuse row number
// 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_M                    0x0000F000
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_DIG_S                    12

// Field: [11:8] VTRIM_COARSE
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.VTRIM_COARSE], ie in efuse row
// number 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_M                 0x00000F00
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_VTRIM_COARSE_S                 8

// Field: [7:0] RCOSCHF_CTRIM
//
// Shadow of [JTAG_TAP::EFUSE:OSC_BIAS_LDO_TRIM.RCOSCHF_CTRIM], ie in efuse row
// number 11
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_M                0x000000FF
#define FCFG1_SHDW_OSC_BIAS_LDO_TRIM_RCOSCHF_CTRIM_S                0

//*****************************************************************************
//
// Register: FCFG1_O_SHDW_ANA_TRIM
//
//*****************************************************************************
// Field: [26:25] BOD_BANDGAP_TRIM_CNF
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.BOD_BANDGAP_TRIM_CNF], ie in efuse row
// number 12
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_M                  0x06000000
#define FCFG1_SHDW_ANA_TRIM_BOD_BANDGAP_TRIM_CNF_S                  25

// Field: [24]    VDDR_ENABLE_PG1
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.VDDR_ENABLE_PG1], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1                         0x01000000
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_BITN                    24
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_M                       0x01000000
#define FCFG1_SHDW_ANA_TRIM_VDDR_ENABLE_PG1_S                       24

// Field: [23]    VDDR_OK_HYS
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.VDDR_OK_HYS], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS                             0x00800000
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_BITN                        23
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_M                           0x00800000
#define FCFG1_SHDW_ANA_TRIM_VDDR_OK_HYS_S                           23

// Field: [22:21] IPTAT_TRIM
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.IPTAT_TRIM], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_M                            0x00600000
#define FCFG1_SHDW_ANA_TRIM_IPTAT_TRIM_S                            21

// Field: [20:16] VDDR_TRIM
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.VDDR_TRIM], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_M                             0x001F0000
#define FCFG1_SHDW_ANA_TRIM_VDDR_TRIM_S                             16

// Field: [15:11] TRIMBOD_INTMODE
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.TRIMBOD_INTMODE], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_M                       0x0000F800
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_INTMODE_S                       11

// Field: [10:6] TRIMBOD_EXTMODE
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.TRIMBOD_EXTMODE], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_M                       0x000007C0
#define FCFG1_SHDW_ANA_TRIM_TRIMBOD_EXTMODE_S                       6

// Field: [5:0] TRIMTEMP
//
// Shadow of [JTAG_TAP::EFUSE:ANA_TRIM.TRIMTEMP], ie in efuse row number 12
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_M                              0x0000003F
#define FCFG1_SHDW_ANA_TRIM_TRIMTEMP_S                              0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_E_P
//
//*****************************************************************************
// Field: [31:24] PSU
//
// Program setup time in cycles. Value will be written to
// FLASH:FSM_PE_OSU.PGM_OSU by the flash device driver when an erase/program
// operation is initiated.
#define FCFG1_FLASH_E_P_PSU_M                                       0xFF000000
#define FCFG1_FLASH_E_P_PSU_S                                       24

// Field: [23:16] ESU
//
// Erase setup time in cycles. Value will be written to FLASH:FSM_PE_OSU.ERA_OSU
// by the flash device driver when an erase/program operation is initiated.
#define FCFG1_FLASH_E_P_ESU_M                                       0x00FF0000
#define FCFG1_FLASH_E_P_ESU_S                                       16

// Field: [15:8] PVSU
//
// Program verify setup time in cycles. Value will be written to
// FLASH:FSM_PE_VSU.PGM_VSU by the flash device driver when an erase/program
// operation is initiated.
#define FCFG1_FLASH_E_P_PVSU_M                                      0x0000FF00
#define FCFG1_FLASH_E_P_PVSU_S                                      8

// Field: [7:0] EVSU
//
// Erase verify setup time in cycles. Value will be written to
// FLASH:FSM_PE_VSU.ERA_VSU by the flash device driver when an erase/program
// operation is initiated.
#define FCFG1_FLASH_E_P_EVSU_M                                      0x000000FF
#define FCFG1_FLASH_E_P_EVSU_S                                      0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_C_E_P_R
//
//*****************************************************************************
// Field: [31:24] RVSU
//
// Repeat verify setup time in cycles. Used for repeated verifies during program
// and erase. Value will be written to FLASH:FSM_EX_VAL.REP_VSU by the flash
// device driver when an erase/program operation is initiated.
#define FCFG1_FLASH_C_E_P_R_RVSU_M                                  0xFF000000
#define FCFG1_FLASH_C_E_P_R_RVSU_S                                  24

// Field: [23:16] PV_ACCESS
//
// Program verify EXECUTEZ->data valid time in half-microseconds. Value will be
// converted to number of FCLK cycles by by flash device driver and the converted
// value is written to FLASH:FSM_EX_VAL.EXE_VALD when an erase/program operation
// is initiated..
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_M                             0x00FF0000
#define FCFG1_FLASH_C_E_P_R_PV_ACCESS_S                             16

// Field: [15:12] A_EXEZ_SETUP
//
// Address->EXECUTEZ setup time in cycles. Value will be written to
// FLASH:FSM_CMP_VSU.ADD_EXZ by the flash device driver when an erase/program
// operation is initiated..
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_M                          0x0000F000
#define FCFG1_FLASH_C_E_P_R_A_EXEZ_SETUP_S                          12

