contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [3:0] VHV_E
//
// Value will be written to FLASH:FVHVCT1.VHVCT_E by the flash device driver when
// an erase/program operation is initiated
#define FCFG1_FLASH_VHV_VHV_E_M                                     0x0000000F
#define FCFG1_FLASH_VHV_VHV_E_S                                     0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_VHV_PV
//
//*****************************************************************************
// Field: [27:24] TRIM13_PV
//
// Value will be written to FLASH:FVHVCT1.TRIM13_PV by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_M                              0x0F000000
#define FCFG1_FLASH_VHV_PV_TRIM13_PV_S                              24

// Field: [19:16] VHV_PV
//
// Value will be written to FLASH:FVHVCT1.VHVCT_PV by the flash device driver
// when an erase/program operation is initiated.
#define FCFG1_FLASH_VHV_PV_VHV_PV_M                                 0x000F0000
#define FCFG1_FLASH_VHV_PV_VHV_PV_S                                 16

// Field: [15:8] VCG2P5
//
// Control gate voltage during read, read margin, and erase verify. Value will be
// written to FLASH:FVNVCT.VCG2P5CT by the flash device driver when an
// erase/program operation is initiated.
#define FCFG1_FLASH_VHV_PV_VCG2P5_M                                 0x0000FF00
#define FCFG1_FLASH_VHV_PV_VCG2P5_S                                 8

// Field: [7:0] VINH
//
// Inhibit voltage applied to unselected columns during programming.
#define FCFG1_FLASH_VHV_PV_VINH_M                                   0x000000FF
#define FCFG1_FLASH_VHV_PV_VINH_S                                   0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_V
//
//*****************************************************************************
// Field: [31:24] VSL_P
//
// Sourceline voltage applied to the selected block during programming. Value will
// be written to FLASH:FVSLP.VSL_P by the flash device driver when an
// erase/program operation is initiated.
#define FCFG1_FLASH_V_VSL_P_M                                       0xFF000000
#define FCFG1_FLASH_V_VSL_P_S                                       24

// Field: [23:16] VWL_P
//
// Wordline voltage applied to the selected half-row during programming. Value will
// be written to  FLASH:FVWLCT.VWLCT_P by the flash device driver when an
// erase/program operation is initiated.
#define FCFG1_FLASH_V_VWL_P_M                                       0x00FF0000
#define FCFG1_FLASH_V_VWL_P_S                                       16

// Field: [15:8] V_READ
//
// Wordline voltage applied to the selected block during reads and verifies. Value
// will be written to FLASH:FVREADCT.VREADCT by the flash device driver when an
// erase/program operation is initiated.
#define FCFG1_FLASH_V_V_READ_M                                      0x0000FF00
#define FCFG1_FLASH_V_V_READ_S                                      8

//*****************************************************************************
//
// Register: FCFG1_O_USER_ID
//
//*****************************************************************************
// Field: [31:28] PG_REV
//
// PG revision number:
#define FCFG1_USER_ID_PG_REV_M                                      0xF0000000
#define FCFG1_USER_ID_PG_REV_S                                      28

// Field: [27:26] VER
//
// Version number.
//
// 0x0: Bits [25:12] of this register has the stated meaning.
//
// Any other setting indicate a different encoding of these bits.
#define FCFG1_USER_ID_VER_M                                         0x0C000000
#define FCFG1_USER_ID_VER_S                                         26

// Field: [24]    BAW
//
// 0: No BAW installed
// 1: Device uses BAW resonator
#define FCFG1_USER_ID_BAW                                           0x01000000
#define FCFG1_USER_ID_BAW_BITN                                      24
#define FCFG1_USER_ID_BAW_M                                         0x01000000
#define FCFG1_USER_ID_BAW_S                                         24

// Field: [23]    ANT
//
// 0: Does not support ANT
// 1: Supports ANT
#define FCFG1_USER_ID_ANT                                           0x00800000
#define FCFG1_USER_ID_ANT_BITN                                      23
#define FCFG1_USER_ID_ANT_M                                         0x00800000
#define FCFG1_USER_ID_ANT_S                                         23

// Field: [22:19] SEQUENCE
//
// Sequence.
//
// Used to differentiate between marketing/orderable product where other fields
// of USER_ID is the same (temp range, flash size, voltage range etc)
#define FCFG1_USER_ID_SEQUENCE_M                                    0x00780000
#define FCFG1_USER_ID_SEQUENCE_S                                    19

// Field: [18:16] PKG
//
// Package type.
//
// 0x0: 4x4mm
// 0x1: 5x5mm
// 0x2: 7x7mm
//
// Others values are reserved for future use.
#define FCFG1_USER_ID_PKG_M                                         0x00070000
#define FCFG1_USER_ID_PKG_S                                         16

// Field: [15:12] PROTOCOL
//
// Protocols supported.
//
// 0x1: BLE
// 0x2: RF4CE
// 0x4: Zigbee/6lowpan
// 0x8: Proprietary
//
// More than one protocol can be supported on same device - values above are
// then combined.
#define FCFG1_USER_ID_PROTOCOL_M                                    0x0000F000
#define FCFG1_USER_ID_PROTOCOL_S                                    12

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA1
//
//*****************************************************************************
// Field: [31:8] SAMPLE_PERIODE
//
// Value will be written to FLASH:SAMPLE_PERIOD.SAMPLE_PERIOD by boot FW while in
// safezone.
#define FCFG1_FLASH_OTP_DATA1_SAMPLE_PERIODE_M                      0xFFFFFF00
#define FCFG1_FLASH_OTP_DATA1_SAMPLE_PERIODE_S                      8

// Field: [7:0] WAITSTATES
//
// Value will be written to FLASH:WAITSTATES.WAITSTATES by boot FW while in
// safezone.
#define FCFG1_FLASH_OTP_DATA1_WAITSTATES_M                          0x000000FF
#define FCFG1_FLASH_OTP_DATA1_WAITSTATES_S                          0

//*****************************************************************************
//
// Register: FCFG1_O_FLASH_OTP_DATA2
//
//*****************************************************************************
// Field: [31:24] PRE_SAMPLE
//
// Value will be written to FLASH:PRE_SAMPLE.PRE_SAMPLE by boot FW while in
// safezone.
#define FCFG1_FLASH_OTP_DATA2_PRE_SAMPLE_M                          0xFF000000
#define FCFG1_FLASH_OTP_DATA2_PRE_SAMPLE_S                          24

// Field: [23:16] SAMHOLD_SA
//
// Value will be written to FLASH:SAMHOLD_SA.SAMHOLD_SA by boot FW while in
// safezone.
#define FCFG1_FLASH_OTP_DATA2_SAMHOLD_SA_M                          0x00FF0000
#define FCFG1_FLASH_OTP_DATA2_SAMHOLD_SA_S                          16

// Field: [15:8] SAMHOLD_SU
//
// Value will be written to FLASH:SAMHOLD_SU.SAMHOLD_SU by boot FW while in
// safezone.
#define FCFG1_FLASH_OTP_DATA2_SAMHOLD_SU_M                          0x0000FF00
#define FCFG1_FLASH_OTP_DATA2_SAMHOLD_SU_S                          8

