contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [26:24] VIN_AT_X_INT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:FSEQPMP.VIN_AT_X by flash device driver FW when a flash write operation
// is initiated.
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_M                    0x07000000
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_WRT_S                    24

// Field: [23]    STANDBY_MODE_SEL_EXT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL by flash device driver FW when a flash write
// operation is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_WRT              0x00800000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_WRT_BITN         23
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_WRT_M            0x00800000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_WRT_S            23

// Field: [22:21] STANDBY_PW_SEL_EXT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL by flash device driver FW when a flash write operation
// is initiated.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_M              0x00600000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_WRT_S              21

// Field: [20]    DIS_STANDBY_EXT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_STANDBY by flash device driver FW when a flash write operation is
// initiated.
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_WRT                   0x00100000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_WRT_BITN              20
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_WRT_M                 0x00100000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_WRT_S                 20

// Field: [19]    DIS_IDLE_EXT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_IDLE by flash device driver FW when a flash write operation is
// initiated.
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_WRT                      0x00080000
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_WRT_BITN                 19
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_WRT_M                    0x00080000
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_WRT_S                    19

// Field: [18:16] VIN_AT_X_EXT_WRT
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:FSEQPMP.VIN_AT_X by flash device driver FW when a flash write operation
// is initiated.
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_M                    0x00070000
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_EXT_WRT_S                    16

// Field: [15]    STANDBY_MODE_SEL_INT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL both by boot FW while in safezone, and by flash
// device driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_RD               0x00008000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_RD_BITN          15
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_RD_M             0x00008000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_INT_RD_S             15

// Field: [14:13] STANDBY_PW_SEL_INT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_M               0x00006000
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_INT_RD_S               13

// Field: [12]    DIS_STANDBY_INT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.DIS_STANDBY both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_RD                    0x00001000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_RD_BITN               12
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_RD_M                  0x00001000
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_INT_RD_S                  12

// Field: [11]    DIS_IDLE_INT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:CFG.DIS_IDLE both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_RD                       0x00000800
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_RD_BITN                  11
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_RD_M                     0x00000800
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_INT_RD_S                     11

// Field: [10:8] VIN_AT_X_INT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 0, this value will be written to
// FLASH:FSEQPMP.VIN_AT_X both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_M                     0x00000700
#define FCFG1_FLASH_OTP_DATA4_VIN_AT_X_INT_RD_S                     8

// Field: [7]    STANDBY_MODE_SEL_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_MODE_SEL both by boot FW while in safezone, and by flash
// device driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD               0x00000080
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_BITN          7
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_M             0x00000080
#define FCFG1_FLASH_OTP_DATA4_STANDBY_MODE_SEL_EXT_RD_S             7

// Field: [6:5] STANDBY_PW_SEL_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.STANDBY_PW_SEL both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_M               0x00000060
#define FCFG1_FLASH_OTP_DATA4_STANDBY_PW_SEL_EXT_RD_S               5

// Field: [4]    DIS_STANDBY_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_STANDBY both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD                    0x00000010
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_BITN               4
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_M                  0x00000010
#define FCFG1_FLASH_OTP_DATA4_DIS_STANDBY_EXT_RD_S                  4

// Field: [3]    DIS_IDLE_EXT_RD
//
// If AON_SYSCTL:PWRCTL.EXT_REG_MODE = 1, this value will be written to
// FLASH:CFG.DIS_IDLE both by boot FW while in safezone, and by flash device
// driver FW after completion of a flash write operation.
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD                       0x00000008
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_BITN                  3
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_M                     0x00000008
#define FCFG1_FLASH_OTP_DATA4_DIS_IDLE_EXT_RD_S                     3

