contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [23:20] INT3ADJ
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCLFCFG0.INT3ADJ].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_INT3ADJ_M                               0x00F00000
#define FCFG1_CONFIG_IF_ADC_INT3ADJ_S                               20

// Field: [19:16] FF1ADJ
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCLFCFG0.FF1ADJ].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_FF1ADJ_M                                0x000F0000
#define FCFG1_CONFIG_IF_ADC_FF1ADJ_S                                16

// Field: [15:14] AAFCAP
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCCTL0.AAFCAP].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_AAFCAP_M                                0x0000C000
#define FCFG1_CONFIG_IF_ADC_AAFCAP_S                                14

// Field: [13:10] INT2ADJ
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFADCCTL0.INT2ADJ].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_INT2ADJ_M                               0x00003C00
#define FCFG1_CONFIG_IF_ADC_INT2ADJ_S                               10

// Field: [9:5] IFDIGLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFDLDO2.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_M                  0x000003E0
#define FCFG1_CONFIG_IF_ADC_IFDIGLDO_TRIM_OUTPUT_S                  5

// Field: [4:0] IFANALDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFALDO2.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_M                  0x0000001F
#define FCFG1_CONFIG_IF_ADC_IFANALDO_TRIM_OUTPUT_S                  0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_OSC_TOP
//
//*****************************************************************************
// Field: [29:26] XOSC_HF_ROW_Q12
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:ANABYPASSVAL1.XOSC_HF_ROW_Q12].
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_M                      0x3C000000
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_ROW_Q12_S                      26

// Field: [25:10] XOSC_HF_COLUMN_Q12
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:ANABYPASSVAL1.XOSC_HF_COLUMN_Q12].
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_M                   0x03FFFC00
#define FCFG1_CONFIG_OSC_TOP_XOSC_HF_COLUMN_Q12_S                   10

// Field: [9:2] RCOSCLF_CTUNE_TRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:LFOSCCTL.RCOSCLF_CTUNE_TRIM].
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_M                   0x000003FC
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_CTUNE_TRIM_S                   2

// Field: [1:0] RCOSCLF_RTUNE_TRIM
//
// Trim value for [ANATOP_MMAP::DDI_0_OSC:LFOSCCTL.RCOSCLF_RTUNE_TRIM].
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_M                   0x00000003
#define FCFG1_CONFIG_OSC_TOP_RCOSCLF_RTUNE_TRIM_S                   0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_RF_FRONTEND
//
//*****************************************************************************
// Field: [31:28] IFAMP_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL3.IB].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_RF_FRONTEND_IFAMP_IB_M                         0xF0000000
#define FCFG1_CONFIG_RF_FRONTEND_IFAMP_IB_S                         28

// Field: [27:24] LNA_IB
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:LNACTL2:IB].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_RF_FRONTEND_LNA_IB_M                           0x0F000000
#define FCFG1_CONFIG_RF_FRONTEND_LNA_IB_S                           24

// Field: [23:19] IFAMP_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:IFAMPCTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_RF_FRONTEND_IFAMP_TRIM_M                       0x00F80000
#define FCFG1_CONFIG_RF_FRONTEND_IFAMP_TRIM_S                       19

// Field: [18:14] CTL_PA0_TRIM
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:PACTL0.TRIM].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_RF_FRONTEND_CTL_PA0_TRIM_M                     0x0007C000
#define FCFG1_CONFIG_RF_FRONTEND_CTL_PA0_TRIM_S                     14

// Field: [13]    PATRIMCOMPLETE_N
//
// Status of PA trim
// 0: Trimmed
// 1: Not trimmed
#define FCFG1_CONFIG_RF_FRONTEND_PATRIMCOMPLETE_N                   0x00002000
#define FCFG1_CONFIG_RF_FRONTEND_PATRIMCOMPLETE_N_BITN              13
#define FCFG1_CONFIG_RF_FRONTEND_PATRIMCOMPLETE_N_M                 0x00002000
#define FCFG1_CONFIG_RF_FRONTEND_PATRIMCOMPLETE_N_S                 13

// Field: [6:0] RFLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_0_RF:RFLDO1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_RF_FRONTEND_RFLDO_TRIM_OUTPUT_M                0x0000007F
#define FCFG1_CONFIG_RF_FRONTEND_RFLDO_TRIM_OUTPUT_S                0

//*****************************************************************************
//
// Register: FCFG1_O_CONFIG_SYNTH
//
//*****************************************************************************
// Field: [27:12] RFC_MDM_DEMIQMC0
//
// Trim value for RFC_MDM:DEMIQMC0.GAINFACTOR and RFC_MDM:DEMIQMC0.PHASEFACTOR
// Value is read by RF Core ROM FW during RF Core initialization only on cc13xx.
#define FCFG1_CONFIG_SYNTH_RFC_MDM_DEMIQMC0_M                       0x0FFFF000
#define FCFG1_CONFIG_SYNTH_RFC_MDM_DEMIQMC0_S                       12

// Field: [11:6] LDOVCO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_1_SYNTH:VCOLDOCTL1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_SYNTH_LDOVCO_TRIM_OUTPUT_M                     0x00000FC0
#define FCFG1_CONFIG_SYNTH_LDOVCO_TRIM_OUTPUT_S                     6

