contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [5:0] SLDO_TRIM_OUTPUT
//
// Trim value for [ANATOP_MMAP::ADI_1_SYNTH:SLDOCTL1.TRIM_OUT].
// Value is read by RF Core ROM FW during RF Core initialization.
#define FCFG1_CONFIG_SYNTH_SLDO_TRIM_OUTPUT_M                       0x0000003F
#define FCFG1_CONFIG_SYNTH_SLDO_TRIM_OUTPUT_S                       0

//*****************************************************************************
//
// Register: FCFG1_O_SOC_ADC_ABS_GAIN
//
//*****************************************************************************
// Field: [31:16] SOC_ADC_ABS_GAIN_TEMP2
//
// SOC_ADC gain in absolute reference mode at temperature 2 (85C?). Calculated in
// production test.
#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP2_M             0xFFFF0000
#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP2_S             16

// Field: [15:0] SOC_ADC_ABS_GAIN_TEMP1
//
// SOC_ADC gain in absolute reference mode at temperature 1 (25C?). Calculated in
// production test..
#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_M             0x0000FFFF
#define FCFG1_SOC_ADC_ABS_GAIN_SOC_ADC_ABS_GAIN_TEMP1_S             0

//*****************************************************************************
//
// Register: FCFG1_O_SOC_ADC_REL_GAIN
//
//*****************************************************************************
// Field: [31:16] SOC_ADC_REL_GAIN_TEMP2
//
// SOC_ADC gain in relative reference mode at temperature 2 (85C?). Calculated in
// production test..
#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP2_M             0xFFFF0000
#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP2_S             16

// Field: [15:0] SOC_ADC_REL_GAIN_TEMP1
//
// SOC_ADC gain in relative reference mode at temperature 1 (25C?). Calculated in
// production test..
#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_M             0x0000FFFF
#define FCFG1_SOC_ADC_REL_GAIN_SOC_ADC_REL_GAIN_TEMP1_S             0

//*****************************************************************************
//
// Register: FCFG1_O_SOC_ADC_EXT_GAIN
//
//*****************************************************************************
// Field: [31:16] SOC_ADC_EXT_GAIN_TEMP2
//
// SOC_ADC gain in external reference mode at temperature 2 (85C?). Calculated in
// production test..
#define FCFG1_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP2_M             0xFFFF0000
#define FCFG1_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP2_S             16

// Field: [15:0] SOC_ADC_EXT_GAIN_TEMP1
//
// SOC_ADC gain in external reference mode at temperature 1 (25C?). Calculated in
// production test..
#define FCFG1_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP1_M             0x0000FFFF
#define FCFG1_SOC_ADC_EXT_GAIN_SOC_ADC_EXT_GAIN_TEMP1_S             0

//*****************************************************************************
//
// Register: FCFG1_O_SOC_ADC_OFFSET_INT
//
//*****************************************************************************
// Field: [31:24] SOC_ADC_REL_OFFSET_TEMP2
//
// SOC_ADC offset in relative reference mode at temperature 2 (85C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP2_M         0xFF000000
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP2_S         24

// Field: [23:16] SOC_ADC_REL_OFFSET_TEMP1
//
// SOC_ADC offset in relative reference mode at temperature 1 (25C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_M         0x00FF0000
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_REL_OFFSET_TEMP1_S         16

// Field: [15:8] SOC_ADC_ABS_OFFSET_TEMP2
//
// SOC_ADC offset in absolute reference mode at temperature 2 (85C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP2_M         0x0000FF00
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP2_S         8

// Field: [7:0] SOC_ADC_ABS_OFFSET_TEMP1
//
// SOC_ADC offset in absolute reference mode at temperature 1 (25C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_M         0x000000FF
#define FCFG1_SOC_ADC_OFFSET_INT_SOC_ADC_ABS_OFFSET_TEMP1_S         0

//*****************************************************************************
//
// Register: FCFG1_O_SOC_ADC_REF_TRIM_AND_OFFSET_EXT
//
//*****************************************************************************
// Field: [31:24] SOC_ADC_EXT_OFFSET_TEMP2
//
// SOC_ADC offset in external reference mode at temperature 2 (85C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP2_M \
                                 0xFF000000
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP2_S 24

// Field: [23:16] SOC_ADC_EXT_OFFSET_TEMP1
//
// SOC_ADC offset in external reference mode at temperature 1 (25C?). Signed 8-bit
// number. Calculated in production test..
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP1_M \
                                 0x00FF0000
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_EXT_OFFSET_TEMP1_S 16

// Field: [15:14] TEST_TEMP_INDEX2
//
// Index of TEST_TEMPS that was used to when the _TEMP2 fields for SOC_ADC were
// written.
//
// 0: TEST_TEMPS.TEST_TEMP1
// 1: TEST_TEMPS.TEST_TEMP2
// 2: TEST_TEMPS.TEST_TEMP3
// 3: TEST_TEMPS.TEST_TEMP4
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX2_M    0x0000C000
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX2_S    14

// Field: [13:8] SOC_ADC_REF_VOLTAGE_TRIM_TEMP2
//
// Value to write in  [ANATOP_MMAP::ADI_4_AUX:ADCREF1.VTRIM] at temperature 2
// (85C?).
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP2_M \
                                 0x00003F00
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP2_S 8

// Field: [7:6] TEST_TEMP_INDEX1
//
// Index of TEST_TEMPS that was used to when the _TEMP1 fields for SOC_ADC were
// written. This should always be room temp.
//
// 0: TEST_TEMPS.TEST_TEMP1
// 1: TEST_TEMPS.TEST_TEMP2
// 2: TEST_TEMPS.TEST_TEMP3
// 3: TEST_TEMPS.TEST_TEMP4
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX1_M    0x000000C0
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_TEST_TEMP_INDEX1_S    6

// Field: [5:0] SOC_ADC_REF_VOLTAGE_TRIM_TEMP1
//
// Value to write in [ANATOP_MMAP::ADI_4_AUX:ADCREF1.VTRIM] at temperature 1
// (25C?).
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_M \
                                 0x0000003F
#define FCFG1_SOC_ADC_REF_TRIM_AND_OFFSET_EXT_SOC_ADC_REF_VOLTAGE_TRIM_TEMP1_S 0

//*****************************************************************************
//
// Register: FCFG1_O_AMPCOMP_TH1
//
//*****************************************************************************
// Field: [23:18] HPMRAMP3_LTH
//
// HPM Ramp3 low amplitude threshhold.
// In HPM_RAMP3, if amp > HPMRAMP3_LTH && amp < HPMRAMP3_HTH then move on
// HPM_UPDATE.
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_M                            0x00FC0000
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_LTH_S                            18

// Field: [15:10] HPMRAMP3_HTH
//
// In HPM_RAMP3, if amp > HPMRAMP3_LTH && amp < HPMRAMP3_HTH then move on to
// HPM_UPDATE.
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_M                            0x0000FC00
#define FCFG1_AMPCOMP_TH1_HPMRAMP3_HTH_S                            10

