contiki-os/contiki/cc26xxware/inc/hw_fcfg1.h
// Field: [7:0] BASELINE
//
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define FCFG1_PWD_CURR_35C_BASELINE_M                               0x000000FF
#define FCFG1_PWD_CURR_35C_BASELINE_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_50C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_M                        0xFF000000
#define FCFG1_PWD_CURR_50C_DELTA_CACHE_REF_S                        24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_M                        0x00FF0000
#define FCFG1_PWD_CURR_50C_DELTA_RFMEM_RET_S                        16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_M                         0x0000FF00
#define FCFG1_PWD_CURR_50C_DELTA_XOSC_LPM_S                         8

// Field: [7:0] BASELINE
//
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define FCFG1_PWD_CURR_50C_BASELINE_M                               0x000000FF
#define FCFG1_PWD_CURR_50C_BASELINE_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_65C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_M                        0xFF000000
#define FCFG1_PWD_CURR_65C_DELTA_CACHE_REF_S                        24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_M                        0x00FF0000
#define FCFG1_PWD_CURR_65C_DELTA_RFMEM_RET_S                        16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_M                         0x0000FF00
#define FCFG1_PWD_CURR_65C_DELTA_XOSC_LPM_S                         8

// Field: [7:0] BASELINE
//
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define FCFG1_PWD_CURR_65C_BASELINE_M                               0x000000FF
#define FCFG1_PWD_CURR_65C_BASELINE_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_80C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_M                        0xFF000000
#define FCFG1_PWD_CURR_80C_DELTA_CACHE_REF_S                        24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_M                        0x00FF0000
#define FCFG1_PWD_CURR_80C_DELTA_RFMEM_RET_S                        16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_M                         0x0000FF00
#define FCFG1_PWD_CURR_80C_DELTA_XOSC_LPM_S                         8

// Field: [7:0] BASELINE
//
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define FCFG1_PWD_CURR_80C_BASELINE_M                               0x000000FF
#define FCFG1_PWD_CURR_80C_BASELINE_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_95C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_M                        0xFF000000
#define FCFG1_PWD_CURR_95C_DELTA_CACHE_REF_S                        24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_M                        0x00FF0000
#define FCFG1_PWD_CURR_95C_DELTA_RFMEM_RET_S                        16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_M                         0x0000FF00
#define FCFG1_PWD_CURR_95C_DELTA_XOSC_LPM_S                         8

// Field: [7:0] BASELINE
//
// Worst-case baseline maximum powerdown current, in units of 0.5uA
#define FCFG1_PWD_CURR_95C_BASELINE_M                               0x000000FF
#define FCFG1_PWD_CURR_95C_BASELINE_S                               0

//*****************************************************************************
//
// Register: FCFG1_O_PWD_CURR_110C
//
//*****************************************************************************
// Field: [31:24] DELTA_CACHE_REF
//
// Additional maximum current, in units of 1uA, with cache retention
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_M                       0xFF000000
#define FCFG1_PWD_CURR_110C_DELTA_CACHE_REF_S                       24

// Field: [23:16] DELTA_RFMEM_RET
//
// Additional maximum current, in 1uA units, with RF memory retention
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_M                       0x00FF0000
#define FCFG1_PWD_CURR_110C_DELTA_RFMEM_RET_S                       16

// Field: [15:8] DELTA_XOSC_LPM
//
// Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_M                        0x0000FF00
#define FCFG1_PWD_CURR_110C_DELTA_XOSC_LPM_S                        8

